src/corners/david/testing.org

#+TITLE: Org Mode Basics
#+STARTUP: showstars latexpreview

* Basic text
/Italics/ *Bold* =Verbatim=
#+BEGIN_SRC python
print("Code snippet!")
#+END_SRC
** Headlines
*** That
**** Nest
     
* Basic Manipulation
- M-RET: New header
- C-RET: Create sibling of item
- TAB: Fold subtree/tree
- SHIFT-TAB: Cycle folding of entire tree
- M-UP and M-DOWN: Move component up/down
- M-RIGHT and M-LEFT: Move component right/left
- M-h: Select contents of component

* Links
[[Configurables]]
[[Configurables][Custom Links]]
[[https://google.com][Custom web links]]
[[github:richardfeynmanrocks][Links straight to github]]
[[file:projects.org][Link to file]]
[[file:projects.org::Ideas][Link to component in file]]
[[file:projects.org::3][Link to line in file]]
[[elisp:(+ 2 2)][Link to elisp code that executes]]
[[elisp:org-agenda][Link to org agenda (link to emacs command using elisp)]]

** Keybinds
- C-c c-l for link insertion/editing
- C-c c-o for following link
- C-c C-x C-n for next link
- C-c C-x C-p for previous link
* Images
Link to a file, then =M-x org-display-inline-images=.

* Simple file settings
#+BEGIN_SRC
#+TITLE: Document Title
#+STARTUP: latexpreview indent showstars
#+END_SRC
TITLE: specifies title
STARTUP: specifies startup settings
* Misc
** =M-x org-toggle-pretty-entities=
Inline \lambda
e^{i\pi} = -1

$\frac{a}{b}$

** Radio target
After specifying a targt such as <<<Special>>> then running =M-x org-radio-update-target-regexp=, all instances of "Special" will link to a buffer named after the target!

* Further features
** Org specific
** Packages
- Notetaking with the [[id:78314aff-cb9f-4cd8-b8a3-d263ea67e6bf][Basics of Org Roam]].

* Configurables
