docs/corners/david/testing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-31 Sun 13:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org Mode Basics</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>

</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Org Mode Basics</h1> <h2 class="subtitle"></h2> <span class="author">Taproot</span> <span class="date">2021-10-31 Sun 12:53</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul></ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#orgf5d1b7e">1. Basic text</a>
<ul>
<li><a href="#org3db0d12">1.1. Headlines</a>
<ul>
<li><a href="#org5d179ab">1.1.1. That</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgef2cfda">2. Basic Manipulation</a></li>
<li><a href="#org573e3f3">3. Links</a>
<ul>
<li><a href="#org3ab0e99">3.1. Keybinds</a></li>
</ul>
</li>
<li><a href="#orgb5603e4">4. Images</a></li>
<li><a href="#org90e686a">5. Simple file settings</a></li>
<li><a href="#org20d6de9">6. Misc</a>
<ul>
<li><a href="#org9b1722b">6.1. <code>M-x org-toggle-pretty-entities</code></a></li>
<li><a href="#org0e74760">6.2. Radio target</a></li>
</ul>
</li>
<li><a href="#org05b77e7">7. Further features</a>
<ul>
<li><a href="#orge4a9520">7.1. Org specific</a></li>
<li><a href="#org6ad7002">7.2. Packages</a></li>
</ul>
</li>
<li><a href="#org4be536c">8. Configurables</a></li>
</ul>
</div></div>
</div>

<div id="outline-container-orgf5d1b7e" class="outline-2">
<h2 id="orgf5d1b7e"><span class="section-number-2">1</span> Basic text</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>Italics</i> <b>Bold</b> <code>Verbatim</code>
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">print</span>(<span class="org-string">"Code snippet!"</span>)
</pre>
</div>
</div>
<div id="outline-container-org3db0d12" class="outline-3">
<h3 id="org3db0d12"><span class="section-number-3">1.1</span> Headlines</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org5d179ab" class="outline-4">
<h4 id="org5d179ab"><span class="section-number-4">1.1.1</span> That</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org13fdeaa"></a>Nest<br /></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgef2cfda" class="outline-2">
<h2 id="orgef2cfda"><span class="section-number-2">2</span> Basic Manipulation</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>M-RET: New header</li>
<li>C-RET: Create sibling of item</li>
<li>TAB: Fold subtree/tree</li>
<li>SHIFT-TAB: Cycle folding of entire tree</li>
<li>M-UP and M-DOWN: Move component up/down</li>
<li>M-RIGHT and M-LEFT: Move component right/left</li>
<li>M-h: Select contents of component</li>
</ul>
</div>
</div>

<div id="outline-container-org573e3f3" class="outline-2">
<h2 id="org573e3f3"><span class="section-number-2">3</span> Links</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="#org4be536c">8</a>
<a href="#org4be536c">Custom Links</a>
<a href="https://google.com">Custom web links</a>

<a href="projects.html">Link to file</a>


<a href="(+ 2 2)">Link to elisp code that executes</a>
<a href="org-agenda">Link to org agenda (link to emacs command using elisp)</a>
</p>
</div>

<div id="outline-container-org3ab0e99" class="outline-3">
<h3 id="org3ab0e99"><span class="section-number-3">3.1</span> Keybinds</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>C-c c-l for link insertion/editing</li>
<li>C-c c-o for following link</li>
<li>C-c C-x C-n for next link</li>
<li>C-c C-x C-p for previous link</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb5603e4" class="outline-2">
<h2 id="orgb5603e4"><span class="section-number-2">4</span> Images</h2>
<div class="outline-text-2" id="text-4">
<p>
Link to a file, then <code>M-x org-display-inline-images</code>.
</p>
</div>
</div>

<div id="outline-container-org90e686a" class="outline-2">
<h2 id="org90e686a"><span class="section-number-2">5</span> Simple file settings</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
#+TITLE: Document Title
#+STARTUP: latexpreview indent showstars
</pre>
<p>
TITLE: specifies title
STARTUP: specifies startup settings
</p>
</div>
</div>
<div id="outline-container-org20d6de9" class="outline-2">
<h2 id="org20d6de9"><span class="section-number-2">6</span> Misc</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org9b1722b" class="outline-3">
<h3 id="org9b1722b"><span class="section-number-3">6.1</span> <code>M-x org-toggle-pretty-entities</code></h3>
<div class="outline-text-3" id="text-6-1">
<p>
Inline &lambda;
e<sup>i&pi;</sup> = -1
</p>

<p>
\(\frac{a}{b}\)
</p>
</div>
</div>

<div id="outline-container-org0e74760" class="outline-3">
<h3 id="org0e74760"><span class="section-number-3">6.2</span> Radio target</h3>
<div class="outline-text-3" id="text-6-2">
<p>
After specifying a targt such as <a id="orgd957817">Special</a> then running <code>M-x org-radio-update-target-regexp</code>, all instances of "<a href="#orgd957817">Special</a>" will link to a buffer named after the target!
</p>
</div>
</div>
</div>

<div id="outline-container-org05b77e7" class="outline-2">
<h2 id="org05b77e7"><span class="section-number-2">7</span> Further features</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orge4a9520" class="outline-3">
<h3 id="orge4a9520"><span class="section-number-3">7.1</span> Org specific</h3>
</div>
<div id="outline-container-org6ad7002" class="outline-3">
<h3 id="org6ad7002"><span class="section-number-3">7.2</span> Packages</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>Notetaking with the .</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4be536c" class="outline-2">
<h2 id="org4be536c"><span class="section-number-2">8</span> Configurables</h2>
<div class="outline-text-2" id="text-8">
</div>
</div>
</div>
</body>
</html>
